/*
 * To change this license header, choose License Headers in Project Properties.
 * To change this template file, choose Tools | Templates
 * and open the template in the editor.
 */
package ooad;

import javax.persistence.*;
import java.util.*;
import java.sql.*;

/**
 *
 * @author Panisa
 */
public class Main {

    /**
     * @param args the command line arguments
     */
    public static void main(String[] args) {
        // TODO code application logic here
        //Scanner input = new Scanner (System.in);


        EntityManagerFactory emf = Persistence.createEntityManagerFactory("Food.odb");
        EntityManager em = emf.createEntityManager();
        
        em.getTransaction().begin();        

                    Food p = new Food();
                    em.persist(p);
                   
                    p.setName("กะหรี่ปั๊บ");
                  
                    p.setType("appetizer");
                   
                    p.setRecipe("วิธีทำ ไส้กะหรี่ปั๊บ\n" +
"1. ใส่เนยลงในกระทะเล็กน้อย \n" +
"2. พอเนยร้อนใส่หอมใหญ่ลงไปผัดให้เหลืองหอม\n" +
"3. ตามด้วยหอมแดง ผัดให้หอม\n" +
"4. ใส่เนื้อไก่ลงไปผัดจนสุก \n" +
"5. ปรุงรสด้วยน้ำตาลทราย ซอสปรุงรส เกลือป่น พริกไทยป่น และผงกะหรี่\n" +
"6. ใส่มันต้มสุกลงไปผัดให้เข้ากัน \n" +
"7. ผัดจนให้ส่วนผสมแห้งดี ยกลงจากเตา ตักใส่จานพักไว้จนส่วนผสมแห้งสนิท\n" +
"\n" +
"วิธีทำ แป้งชั้นใน\n" +
"1. ร่อนแป้ง 1 ครั้ง แล้วทำหลุมตรงกลางแป้ง\n" +
"2. ใส่น้ำมันพืชลงไปในหลุม ใช้ไม้พายคนตะล่อมจนแป้งจับตัวเป็นก้อนจากนั้นใช้มือนวดจนแป้งเนียน\n" +
"\n" +
"วิธีทำ แป้งชั้นนอก\n" +
"1. ร่อนแป้ง 1 ครั้ง แล้วทำแป้งเป็นหลุมตรงกลาง\n" +
"2. ผสมน้ำปูนใส น้ำตาลทราย เกลือป่น และน้ำเย็นเข้าด้วยกัน คนผสมให้ละลาย \n" +
"3. เทน้ำมันพืชและน้ำที่ผสมไว้ลงไปในหลุมแป้งแล้วนวดพอเข้ากันหลังจากทำแป้งทั้ง 2 ชั้นเสร็จแล้ว แบ่งแป้งทั้งสอง เป็น 10 ก้อนขนาดเท่า ๆ กัน \n" +
"แผ่แป้งชั้นนอกเป็นแผ่น ๆ แล้วนำไปหุ้มแป้งชั้นในให้มิด คลึงเป็นก้อนกลม ๆ แล้วพักแป้งทิ้งไว้ประมาณ 10 นาที นำแป้งที่พักแล้วมารีดเป็นแผ่นยาว ๆ **โดยรีดขึ้น-ลงเท่านั้น** แล้วม้วนแป้งให้แน่น\n" +
"\n" +
"วิธีการห่อกะหรี่ปั๊บ\n" +
"นำแป้งที่ม้วนไว้ 1 ก้อน มารีดตามยาวให้ได้ความยาวประมาณ 5-6 นิ้ว (**รีดขึ้น-ลงเท่านั้นห้ามรีดไปด้านข้าง**) จากนั้นม้วนแป้งให้แน่น \n" +
"จับแป้งวางแนวตั้งแล้วรีดให้ได้ความยาวประมาณ 10-11 นิ้ว จากนั้นม้วนแป้งให้แน่น \n" +
"ตัดแบ่งแป้งเป็น 3 ส่วน พักแป้งแล้วรีดอีกครั้ง (ทำเหมือนเดิม พักแป้งอีกครั้งประมาณ 10 นาที\n" +
"แต่จริง ๆ แล้ว พอรีดแป้งหมดแล้ว แป้งที่รีดไปก่อนก็พร้อมตัดแบ่งพอดีเลยค่ะ ไม่ต้องรอพักนานเอาด้านที่สวยคว่ำลง (ด้านที่โดนมีดหั่นค่ะ) จับปลายแป้งมาแปะไว้ตรงกลาง)\n" +
"รีดแป้งออกเป็นแผ่นวงรี หนาประมาณ 1/8 นิ้ว \n" +
"ตักส่วนผสมไส้ใส่ประมาณ 1 ช้อนโต๊ะ\n" +
"จับริมแป้งแล้วพับทบเข้าหากัน บีบริมแป้งให้แน่น ๆ แล้วจับจีบให้สวยงาม ทำจนหมด เตรียมไว้\n" +
"นำกะหรี่ปั๊บที่ห่อแล้วไปทอดในน้ำมันร้อน ๆ ใช้ไฟค่อนข้างอ่อน หมั่นพลิกไปพลิกมาเรื่อย ๆจนขนมเป็นสีเหลืองสวย จากนั้นเร่งไฟแรงก่อนตักขึ้น จากนั้นตักขึ้นสะเด็ดน้ำมัน พร้อมเสิร์ฟ");
                    

   
        em.getTransaction().commit();
        
         em.close();
        emf.close();
         
    }
    
}
